cfd/conv_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0)
    (1 0 -0)
    (1 3.99619289 -0.174477549)
    (1 3.99619289 0.174477549)
    (-4 0 -0)
    (8 0 -0)
    (8 3.99619289 -0.174477549)
    (8 3.99619289 0.174477549)
    (0.301426055 0.0771714613 -0.00336937877)
    (0.301426055 0.0771714613 0.00336937877)
    (0.301426055 3.95699738 -0.172766237)
    (0.301426055 3.95699738 0.172766237)
);

blocks
(
    hex (0 8 10 4 0 9 11 4) (169 155 1)
    edgeGrading (((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3))  ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891))  1 1 1 1)
    hex (8 1 2 10 9 1 3 11) (226 155 1)
    edgeGrading (((0.6 0.5 0.4) (0.4 0.5 0.12)) ((0.6 0.5 0.4) (0.4 0.5 0.12)) ((0.6 0.5 0.4) (0.4 0.5 0.12)) ((0.6 0.5 0.4) (0.4 0.5 0.12))  ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891))  1 1 1 1)
    hex (1 5 6 2 1 5 7 3) (226 155 1)
    edgeGrading (40 40 40 40  ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891)) ((0.012715 0.548387 793.228) (0.987285 0.451613 53.4891))  1 1 1 1)
);

edges
(
...
...
    polyLine 4 10 ((-3.99663634 0.146558031 -0.00639886181) (-3.98654987 0.292918873 -0.0127891142) (-3.96975418 0.438885603 -0.0191621592) (-3.94627186 0.584261827 -0.0255094223) (-3.9161345 0.728851948 -0.0318223633) (-3.87938265 0.872461424 -0.0380924884) (-3.83606576 1.01489703 -0.0443113614) (-3.78624212 1.15596713 -0.050470615) (-3.72997875 1.29548192 -0.0565619622) (-3.66735136 1.43325368 -0.0625772072) (-3.59844421 1.56909705 -0.0685082567) (-3.52335002 1.70282925 -0.0743471308) (-3.44216981 1.83427036 -0.0800859734) (-3.35501282 1.96324352 -0.0857170631) (-3.26199631 2.0895752 -0.0912328235) (-3.16324544 2.21309543 -0.0966258333) (-3.05889306 2.33363802 -0.101888836) (-2.94907959 2.45104078 -0.107014752) (-2.83395276 2.56514575 -0.111996682) (-2.71366749 2.67579941 -0.116827925) (-2.5883856 2.78285287 -0.12150198) (-2.45827567 2.8861621 -0.126012559) (-2.32351274 2.9855881 -0.130353592) (-2.18427815 3.08099709 -0.134519238) (-2.04075922 3.17226071 -0.138503894) (-1.89314905 3.25925617 -0.142302197) (-1.74164626 3.3418664 -0.145909038) (-1.58645467 3.41998028 -0.149319564) (-1.4277831 3.49349268 -0.152529185) (-1.26584503 3.56230472 -0.155533583) (-1.10085835 3.6263238 -0.158328716) (-0.933045035 3.68546379 -0.160910824) (-0.762630875 3.73964511 -0.163276432) (-0.589845157 3.78879487 -0.165422357) (-0.414920357 3.83284694 -0.167345711) (-0.23809183 3.87174205 -0.169043908) (-0.0595974949 3.90542786 -0.170514663) (0.120322492 3.93385906 -0.171755996))
    polyLine 10 2 ((0.319225211 3.95897855 -0.172852737) (0.337033162 3.96090858 -0.172937003) (0.354849676 3.96278744 -0.173019036) (0.372674526 3.96461511 -0.173098834) (0.390507479 3.96639156 -0.173176395) (0.408348305 3.96811677 -0.17325172) (0.426196775 3.96979073 -0.173324806) (0.444052657 3.9714134 -0.173395654) (0.461915721 3.97298477 -0.173464261) (0.479785736 3.97450481 -0.173530628) (0.497662471 3.97597351 -0.173594752) (0.515545695 3.97739085 -0.173656635) (0.533435178 3.9787568 -0.173716274) (0.551330688 3.98007136 -0.173773669) (0.569231994 3.98133451 -0.173828819) (0.587138865 3.98254622 -0.173881723) (0.605051069 3.98370648 -0.173932381) (0.622968375 3.98481529 -0.173980793) (0.640890552 3.98587261 -0.174026957) (0.658817367 3.98687845 -0.174070872) (0.676748591 3.98783278 -0.174112539) (0.69468399 3.9887356 -0.174151957) (0.712623333 3.98958689 -0.174189125) (0.730566388 3.99038664 -0.174224043) (0.748512924 3.99113484 -0.17425671) (0.766462709 3.99183149 -0.174287127) (0.784415511 3.99247656 -0.174315291) (0.802371098 3.99307007 -0.174341204) (0.820329237 3.99361198 -0.174364865) (0.838289698 3.99410231 -0.174386273) (0.856252248 3.99454104 -0.174405429) (0.874216654 3.99492817 -0.174422331) (0.892182686 3.9952637 -0.17443698) (0.91015011 3.99554761 -0.174449376) (0.928118695 3.9957799 -0.174459518) (0.946088209 3.99596058 -0.174467407) (0.964058419 3.99608964 -0.174473042) (0.982029093 3.99616707 -0.174476422))
...
...
    polyLine 4 11 ((-3.99663634 0.146558031 0.00639886181) (-3.98654987 0.292918873 0.0127891142) (-3.96975418 0.438885603 0.0191621592) (-3.94627186 0.584261827 0.0255094223) (-3.9161345 0.728851948 0.0318223633) (-3.87938265 0.872461424 0.0380924884) (-3.83606576 1.01489703 0.0443113614) (-3.78624212 1.15596713 0.050470615) (-3.72997875 1.29548192 0.0565619622) (-3.66735136 1.43325368 0.0625772072) (-3.59844421 1.56909705 0.0685082567) (-3.52335002 1.70282925 0.0743471308) (-3.44216981 1.83427036 0.0800859734) (-3.35501282 1.96324352 0.0857170631) (-3.26199631 2.0895752 0.0912328235) (-3.16324544 2.21309543 0.0966258333) (-3.05889306 2.33363802 0.101888836) (-2.94907959 2.45104078 0.107014752) (-2.83395276 2.56514575 0.111996682) (-2.71366749 2.67579941 0.116827925) (-2.5883856 2.78285287 0.12150198) (-2.45827567 2.8861621 0.126012559) (-2.32351274 2.9855881 0.130353592) (-2.18427815 3.08099709 0.134519238) (-2.04075922 3.17226071 0.138503894) (-1.89314905 3.25925617 0.142302197) (-1.74164626 3.3418664 0.145909038) (-1.58645467 3.41998028 0.149319564) (-1.4277831 3.49349268 0.152529185) (-1.26584503 3.56230472 0.155533583) (-1.10085835 3.6263238 0.158328716) (-0.933045035 3.68546379 0.160910824) (-0.762630875 3.73964511 0.163276432) (-0.589845157 3.78879487 0.165422357) (-0.414920357 3.83284694 0.167345711) (-0.23809183 3.87174205 0.169043908) (-0.0595974949 3.90542786 0.170514663) (0.120322492 3.93385906 0.171755996))
    polyLine 11 3 ((0.319225211 3.95897855 0.172852737) (0.337033162 3.96090858 0.172937003) (0.354849676 3.96278744 0.173019036) (0.372674526 3.96461511 0.173098834) (0.390507479 3.96639156 0.173176395) (0.408348305 3.96811677 0.17325172) (0.426196775 3.96979073 0.173324806) (0.444052657 3.9714134 0.173395654) (0.461915721 3.97298477 0.173464261) (0.479785736 3.97450481 0.173530628) (0.497662471 3.97597351 0.173594752) (0.515545695 3.97739085 0.173656635) (0.533435178 3.9787568 0.173716274) (0.551330688 3.98007136 0.173773669) (0.569231994 3.98133451 0.173828819) (0.587138865 3.98254622 0.173881723) (0.605051069 3.98370648 0.173932381) (0.622968375 3.98481529 0.173980793) (0.640890552 3.98587261 0.174026957) (0.658817367 3.98687845 0.174070872) (0.676748591 3.98783278 0.174112539) (0.69468399 3.9887356 0.174151957) (0.712623333 3.98958689 0.174189125) (0.730566388 3.99038664 0.174224043) (0.748512924 3.99113484 0.17425671) (0.766462709 3.99183149 0.174287127) (0.784415511 3.99247656 0.174315291) (0.802371098 3.99307007 0.174341204) (0.820329237 3.99361198 0.174364865) (0.838289698 3.99410231 0.174386273) (0.856252248 3.99454104 0.174405429) (0.874216654 3.99492817 0.174422331) (0.892182686 3.9952637 0.17443698) (0.91015011 3.99554761 0.174449376) (0.928118695 3.9957799 0.174459518) (0.946088209 3.99596058 0.174467407) (0.964058419 3.99608964 0.174473042) (0.982029093 3.99616707 0.174476422))
);

defaultPatch { name defaultFaces; type empty; }

boundary
(
    corpo    { type wall;  faces ((0 8 9 0) (8 1 1 9)); }
    esterno  { type patch; faces ((4 10 11 4) (10 2 3 11)
                                  (2 6 7 3)); }
    uscita   { type patch; faces ((5 6 7 5)); }
    front    { type wedge; faces ((0 8 10 4) (8 1 2 10)
                                  (1 5 6 2)); }
    back     { type wedge; faces ((0 4 11 9) (9 11 3 1)
                                  (1 3 7 5)); }
);
